Revit 2027 API
Family.FamilyPlacementType Property
 Identifies the type of placement required by a given family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyPlacementType FamilyPlacementType { get; }
Public ReadOnly Property FamilyPlacementType As FamilyPlacementType
	Get
public:
property FamilyPlacementType FamilyPlacementType {
	FamilyPlacementType get ();
}
member FamilyPlacementType : FamilyPlacementType with get
Property Value
FamilyPlacementType
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace